app/Controllers/EmpresaController.php

SELECT `empresas`.*
FROM `categorias_empresas`
JOIN `empresas` ON `empresas`.`idempresa` = `categorias_empresas`.`idempresa`
WHERE `categorias_empresas`.`activo` = 1
AND `categorias_empresas`.`idcategoria` = '4'
AND `empresas`.`activo` = 1
---
    public function geEmpresaCategoria($cate){
        try {
            $empresas= $this->categoriaEmpresa->select("empresas.*")
            ->join("empresas","empresas.idempresa = categorias_empresas.idempresa")
            ->where([
                "categorias_empresas.activo"=>true,
                "categorias_empresas.idcategoria"=>$cate,
                "empresas.activo"=>true,
            ])->findAll();

SELECT *
FROM `empresas`
WHERE `activo` = 1
---
    public function list(){
        try {
            $empresas = $this->empresa->where('activo',true)->findAll();