app/Controllers/MenuController.php

    public function list(){
        try {
            $menues = $this->menu->select("menu.*,empresas.nombre as empresa,categoria_negocio.nombre as categoria")
                        ->join("empresas","empresas.idempresa= menu.idempresa","inner")
                        ->join("categoria_negocio","categoria_negocio.idcategoria=menu.idcategoria","inner")
                        ->where([
                            "menu.activo"=>true
                        ])->findAll();
---
SELECT `menu`.*, `empresas`.`nombre` as `empresa`, `categoria_negocio`.`nombre` as `categoria`
FROM `menu`
INNER JOIN `empresas` ON `empresas`.`idempresa`= `menu`.`idempresa`
INNER JOIN `categoria_negocio` ON `categoria_negocio`.`idcategoria`=`menu`.`idcategoria`
WHERE `menu`.`activo` = 1

    private function getMenuByEMpresa($menu){
        $menu = $this->mdetalle->select("menu_detalle.*,menu.idmenu as m")
        ->join("menu","menu_detalle.idmenu=menu.idmenu","inner")
        ->where([
            "menu.idmenu"=>$menu,
            "menu_detalle.activo"=>true,
        ])->findAll();
---
SELECT `menu_detalle`.*, `menu`.`idmenu` as `m`
FROM `menu_detalle`
INNER JOIN `menu` ON `menu_detalle`.`idmenu`=`menu`.`idmenu`
WHERE `menu`.`idmenu` = '22'
AND `menu_detalle`.`activo` = 1