app/Controllers/MunicipiosController.php

SELECT *
FROM `municipios`
WHERE `activo` = 1
---
    public function list(){
        try {
            $municipios = $this->municipio->where('activo',true)->findAll();