app/Controllers/PedidoController.php

    public function list(){
        try {
            if(!$this->session->has('idusuarioapp')){
                return $this->response->setStatusCode(401,'NO session')
                    ->setJSON(['message'=>'no logueado']);
            }

            $pedidos = $this->pedido->where([
                'idusuarioapp'=>$this->session->get('idusuarioapp'),
                'activo'=>true,
                'estado'=>0
            ])->findAll();
            $pedidosdata=[];
            if(count($pedidos)>0){
                foreach($pedidos as $pedido){
                    $detallepedido= $this->pedidodetalle->select("pedidos_detalle.*,menu_detalle.nombre,menu_detalle.precio,menu_detalle.foto")
                    ->join("menu_detalle","pedidos_detalle.idmenudetalle=menu_detalle.idmenudetalle",'inner')
                    ->where([
                    'pedidos_detalle.idpedido'=>$pedido['idpedido'],
                    'pedidos_detalle.activo'=>true
                    ])->findAll();
---
SELECT *
FROM `pedidos`
WHERE `idusuarioapp` = '2'
AND `activo` = 1
AND `estado` = 0
SELECT `pedidos_detalle`.*, `menu_detalle`.`nombre`, `menu_detalle`.`precio`, `menu_detalle`.`foto`
FROM `pedidos_detalle`
INNER JOIN `menu_detalle` ON `pedidos_detalle`.`idmenudetalle`=`menu_detalle`.`idmenudetalle`
WHERE `pedidos_detalle`.`idpedido` = '2'
AND `pedidos_detalle`.`activo` = 1

    public function updatePedido($idpedido){
        try {
            if(!$this->session->has('idusuarioapp')){
                return $this->response->setStatusCode(401,'NO session')
                    ->setJSON(['message'=>'no logueado']);
            }
            $data = $this->request->getJSON(true);

            $this->pedido->update($idpedido,[
                'estado'=>$data['estado'],
                'direccion_entrega'=>trim($data['direccion']),
                'comentario'=>trim($data['comentario'])
            ]);
---
UPDATE `pedidos` SET `estado` = 1, `direccion_entrega` = 'Quelepa', `comentario` = ''
WHERE `pedidos`.`idpedido` IN ('2')

    public function createPedido(){
        try {
            $this->db->transStart();
            if(!$this->session->has('idusuarioapp')){
                return $this->response->setStatusCode(401,'NO session')
                    ->setJSON(['message'=>'no logueado']);
            }
            $data = $this->request->getJSON(true);

            $idpedido = $this->pedido->insert([
                'idusuarioapp'=>$this->session->get('idusuarioapp'),
                'estado'=>0,
                'direccion_entrega'=>$this->session->get('direccion'),
                'tipo_pago'=>'efectivo',
                'subtotal'=>$data['subtotal'],
                'descuento'=>$data['descuento'],
                'total'=>$data['total'],
                'idempresa'=>$data['idempresa'],
                'activo'=>true
            ]);
---
INSERT INTO `pedidos` (`idusuarioapp`, `estado`, `direccion_entrega`, `tipo_pago`, `subtotal`, `descuento`, `total`, `idempresa`, `activo`) VALUES ('2', 0, 'Quelepa', 'efectivo', 8.97, 0, 8.97, 5, 1)