app/Controllers/SucursalController.php

    public function list(){
        try {
            $sucursales = $this->sucursal->select("sucursales.*,empresas.nombre as empresa,departamentos.nombre as departamento,municipios.nombre as municipio")
            ->join("empresas","empresas.idempresa=sucursales.idempresa","inner")
            ->join("departamentos","departamentos.iddepartamento=sucursales.iddepartamento","inner")
            ->join("municipios","municipios.idmunicipio=sucursales.idmunicipio","inner")
            ->where([
               "sucursales.activo"=>true
            ])->findAll();
---
SELECT `sucursales`.*, `empresas`.`nombre` as `empresa`, `departamentos`.`nombre` as `departamento`, `municipios`.`nombre` as `municipio`
FROM `sucursales`
INNER JOIN `empresas` ON `empresas`.`idempresa`=`sucursales`.`idempresa`
INNER JOIN `departamentos` ON `departamentos`.`iddepartamento`=`sucursales`.`iddepartamento`
INNER JOIN `municipios` ON `municipios`.`idmunicipio`=`sucursales`.`idmunicipio`
WHERE `sucursales`.`activo` = 1